Autodesk.Revit.DB.PointClouds.IPointCloudAccess.Free
Completes the lifetime of the object providing this interface.
Remarks:
Calling this function indicates that the IPointCloudAccess interface is not going to be used
after the call returns, and the provider of the interface can dispose of all allocated resources.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointCloudAccess.GetColorEncoding
Returns the encoding used by points in this point cloud.
Returns:
The encoding.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointCloudAccess.GetName
Implement this method to return the name of the point cloud that will be used when Revit needs to
refer to the point cloud type, e.g. in the Manage Links dialog or in the
Type Properties dialog.
Returns:
The name of the point cloud for Revit's user interface.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointCloudAccess.GetExtent
Implement this method to returns an object that contains the bounding box of the entire
point cloud, aligned to the point cloud coordinate system.
Remarks:
The extents should reflect the maximum and minimum coordinates of the stored points, and
not incorporate the offset.
Returns:
The bounding box of the point cloud.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointCloudAccess.GetOffset
Implement this method to return the offset stored in the point cloud.
Remarks:
All points are assumed to be offset by the same offset vector.  The offset should be
expressed in the same units as used by the point coordinates (the scale conversion factor
is not applied).   The offset will be used by Revit if the user chooses to place an instance
relative to another point cloud (the "Auto - Origin To Last Placed" placement option).
Returns:
The offset vector of this point cloud's coordinate system.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointCloudAccess.ReadPoints(Autodesk.Revit.DB.PointClouds.PointCloudFilter,Autodesk.Revit.DB.ElementId,System.IntPtr,System.Int32)
Implement this method so that on successive invocations it will return distinct subsets of
points which meet the criterion.
rFilter:
The filter used to process cloud points and determine which ones lie with the target volume.
viewId:
The view id for the current view passed as auxiliary information to allow the
engine to optimize retrieval of points.  If viewId == InvalidElementId, the
query is not for a view display operation.
buffer:
Memory buffer into which the points should be written. The buffer was allocated
by Revit and it is guaranteed to be valid for the duration of the call.
nBufferSize:
The maximum number of CloudPoint objects that may be copied into the buffer.
Returns:
The actual number of CloudPoint objects placed in the buffer (can be less than the
length of the buffer).  If there are no points available that match the filter criteria, return 0.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointCloudAccess.CreatePointSetIterator(Autodesk.Revit.DB.PointClouds.PointCloudFilter,System.Double,Autodesk.Revit.DB.ElementId)
Implement this method to return an iterator for iterating over blocks of this point cloud.
rFilter:
The filter used to process cloud points and determine which ones lie with the target volume.
density:
Desired number of points per unit area. Area is computed in native units of the point cloud.
Another iterator, created with the same density and a more restrictive
filter, should return a subset of the points returned by this iterator.
viewId:
The view id for the current view passed as auxiliary information to allow the
engine to optimize retrieval of points.  If viewId == InvalidElementId, the
query is not for a view display operation.
Returns:
The newly created iterator.
Since:
2013

Autodesk.Revit.DB.PointClouds.IPointCloudAccess.CreatePointSetIterator(Autodesk.Revit.DB.PointClouds.PointCloudFilter,Autodesk.Revit.DB.ElementId)
Implement this method to return an iterator for iterating over blocks of this point cloud.
rFilter:
The filter used to process cloud points and determine which ones lie with the target volume.
viewId:
The view id for the current view passed as auxiliary information to allow the
engine to optimize retrieval of points.  If viewId == InvalidElementId, the
query is not for a view display operation.
Returns:
The newly created iterator.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointCloudAccess.GetUnitsToFeetConversionFactor
Implement this method to return the conversion factor from the units of the point cloud to feet.
Returns:
The multiplication factor to convert coordinates of points in this cloud to feet.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointCloudAccess
An interface that provides functionality for working with an individual
Point Cloud.
Remarks:
An instance of this interface is obtained from the associated point cloud
engine when the engine's CreatePointCloudAccess method is called.
An instance of this class will be requested by Revit when drawing the point cloud in the view.  For performance reasons,
when rendering every frame Revit asks the engine to fetch the necessary points split into multiple batches.
The number of batches requested depends on the view: the smaller the projection of the cloud bounding box on the screen
the fewer batches Revit requests. Revit assumes that each batch contains points uniformly distributed over the visible part of
the cloud ("visible" as defined by the filter). Thus, the points supplied by the engine should not be geometrically distinct (e.g.
divided into multiple independent volumes, because at distant zoom levels Revit will only request a few batches and only part
of the cloud will be displayed.
Since:
2012